app/Controllers/User.php

INSERT INTO `user` (`name`, `email`, `contact`, `profile_img`, `password`, `created_at`, `updated_at`) VALUES ('Sehajbir Singh', 'sehajbirsingh@gmail.com', '9999999999', 'Sehajbir Singh_8.jpeg', '$2y$10$3AzBhBGWcRt7KfObRuc/cefWh52UCql//jyKG31vXufDHyujHOJnO', '2022-12-11 02:09:27', '2022-12-11 02:09:27')
---
	public function userRegister()
	{
		/*print_r($this->request->getFiles());
		print_r($this->request->getPost());die;*/
		$img='';
		$files=$this->request->getFile('profile_img');
		if(!$files->isValid()){
			session()->setFlashData("Error", "Profile Image is Required");
			return redirect()->back()->withInput();
		}
		if(!$this->userModel->isValidFileType($files->getMimeType())){
			session()->setFlashData("Error", "Please Upload a Valid Image File Type");
			return redirect()->back()->withInput();
		}
		$file=$files->move('public/uploads/user/', $files->getClientName());
		if($files->hasMoved()){
			$img=$files->getName();
		}else{
			session()->setFlashData("Error", "Profile Image Fialed to Upload");
			return redirect()->back()->withInput();
		}
		//echo $img;
		$data=[
			'name'=>$this->request->getPost('name'),
			'email'=>$this->request->getPost('email'),
			'contact'=>$this->request->getPost('contact'),
			'profile_img'=>$img,
			'password'=>$this->request->getPost('password'),
			'confirm_password'=>$this->request->getPost('confirm_password')
		];
		if(!$this->userModel->insert($data)){

SELECT *
FROM `user`
WHERE `email` = 'sehajbirsingh@gmail.com'
---
	function userLogin(){
		//print_r($this->request->getPost());die;
		$find=$this->userModel->getWhere(['email'=>$this->request->getPost('email')])->getRowArray();

UPDATE `user` SET `name` = 'Sehajbir Singh', `contact` = '9999999999', `updated_at` = '2022-12-11 02:07:45'
WHERE `user`.`id` IN ('7')
---
	public function profileupdate()
	{
		/*print_r($this->request->getPost());
		print_r($this->request->getFile('profile_img'));die;*/
		$img='';
		$files=$this->request->getFile('profile_img');
		$data=[];
		if(!$files->isValid()){
			//it means you don't want to change your profile photo/Image.
			$data=[
				'name'=>$this->request->getPost('name'),
				'contact'=>$this->request->getPost('contact')
			];
		}else{
			//if you want to change your profile photo also.
			if(!$this->userModel->isValidFileType($files->getMimeType())){
				session()->setFlashData("Error", "Please Upload a Valid Image File Type");
				return redirect()->back()->withInput();
			}
			$file=$files->move('public/uploads/user/', $files->getClientName());
			if($files->hasMoved()){
				$img=$files->getName();
			}
			$data=[
				'name'=>$this->request->getPost('name'),
				'contact'=>$this->request->getPost('contact'),
				'profile_img'=>$img
			];
		}
		if(!$this->userModel->update(session()->get('LoggedUserData')['id'], $data)){

SELECT *
FROM `user`
WHERE `id` = '7'
---
			session()->setFlashData("ErrorData", $this->userModel->errors());
			return redirect()->back()->withInput();
		}
		$find=$this->userModel->getWhere(['id'=>session()->get('LoggedUserData')['id']])->getRowArray();